Repository: BloomBooks/BloomDesktop
Catalog: DistFiles/localization/Bloom.rw.tmx
Source language: rw
Languages: en

source: Amagambo yose ashoboka kuri buri gitabo mu gihe agaragaye rimwe gusa
en: Maximum Unique Words per Book

source: Andi magambo
en: More Words

source: Gufungura idosiye y'inyandiko z'icyitegererezo z'uru rurimi
en: Open the sample texts folder for this language.

source: Ipaji
en: Page

source: Amagambo yose ashoboka kuri buri paaji
en: Maximum Words on each Page

source: Byakozwe na
en: Powered by

source: Kuramo urwego {0}
en: Remove Level {0}

source: Kuramo intambwe {0}
en: Remove Stage {0}

source: Kurubana imbariro upange neza inzego.
en: Drag rows to reorder levels.

source: Kurubana imbariro upange neza intambwe.
en: Drag rows to reorder stages.

source: Urutonde rw'amagambo n'inyandiko z'icyitegererezo
en: Word Lists and Sample Texts

source: , Urubuga rw'ishakisha ku bijyanye n'ugusoma no kwandika.
en: , the Search Engine for Literacy.

source: Inyuguti zabanje n'inshya
en: Previous and New Letters

source: Interuro
en: Sentence

source: Amagambo yose ashoboka muri buri nteruro
en: Maximum Words in each Sentence

source: gushyiraho itonde ry'inyuguti z'uru rurimi
en: set up the alphabet for this language.

source: Amagambo y'irebero ni iki?
en: What are sight words?

source: Amagambo mashya y'irebero
en: New Sight Words

source: Amagambo y'irebero
en: Sight Words

source: Ibintu ukwiye kuzirikana kuri uru rwego:
en: Things to remember for this level:

source: Cyihariye
en: Unique

source: Amagambo
en: Words

source: 2) Gushyira ifishiye y'inyandiko zawe muri
en: 2) Place Text Files in Your

source: Idosiye ibamo inyandiko z'icyitegererezo
en: Sample Text Folder

source: 1) Andika amagambo hano
en: 1) Type Words Here

source: Imeyili
en: Email Address

source: Izina ry'idini
en: First Name

source: Turasaba ko wafata umunota umwe ukiyandikisha {0}
en: Please take a minute to register {0}

source: Ukoresha ute {0}?
en: How are you using {0}?

source: Byanyobeye, ibi ndabirangiza nyuma.
en: I'm stuck, I'll finish this later.

source: Ikigo
en: Organization

source: &Kwiyandikisha
en: &Register

source: Izina ry'umuryango
en: Surname

source: Kwiyandikisha {0}
en: Register {0}

source: Igitabo cy'ibanze
en: Basic Book

source: Igitabo kinini
en: Big Book

source: Umusomyi ugishakisha
en: Decodable Reader

source: Umusomyi umenyereye
en: Leveled Reader

source: Inkoranya y'Amashusho
en: Picture Dictionary

source: Kalendari yo ku rukuta
en: Wall Calendar

source: Ubuhinzi
en: Agriculture

source: Inkuru z'inyamaswa
en: Animal Stories

source: Bizinesi
en: Business

source: Imibereho y'abaturage
en: Community Living

source: Umuco
en: Culture

source: Inkoranyamagambo
en: Dictionary

source: Ibidukikije
en: Environment

source: Inkuru mpimbano
en: Fiction

source: Ni gute bikorwa
en: How To

source: Imibare
en: Math

source: Inkuru zitari mpimbano
en: Non Fiction

source: Iterambere bwite rya muntu
en: Personal Development

source: Igitabo cy'inyigisho
en: Primer

source: Ubumenyi
en: Science

source: Cy'iyobokamana
en: Spiritual

source: Ubumenyi gakondo
en: Tradition

source: Inkuru za kera
en: Traditional Story

source: Ikora
en: Setup
